In [1]:
import pandas as pd

In [2]:
marksUT= {'Name':['Alvin','Alvin','Alvin','Belle','Belle','Belle', 'Chip','Chip','Chip','Dale','Dale','Dale'],
'UT':[1,2,3,1,2,3,1,2,3,1,2,3], #Unit test 1,2,3
'Math':[22,21,14,20,23,22,23,24,12,15,18,17],
'Science':[21,20,19,17,15,18,19,22,25,22,21,18],
'Engl':[18,17,15,22,21,19,20,24,19,25,25,20],
'Hist':[20,22,24,24,25,23,15,17,21,22,24,25],
'Liter':[21,24,23,19,15,13,22,21,23,22,23,20]
}
df=pd.DataFrame(marksUT)

# 1. Sorting a DataFrame

###  Syntax:
_DataFrame.sort_values(by, axis=0, ascending=True)_

In [3]:
#By default, sorting is done in ascending order.
print(df.sort_values(by=['Name']))

     Name  UT  Math  Science  Engl  Hist  Liter
0   Alvin   1    22       21    18    20     21
1   Alvin   2    21       20    17    22     24
2   Alvin   3    14       19    15    24     23
3   Belle   1    20       17    22    24     19
4   Belle   2    23       15    21    25     15
5   Belle   3    22       18    19    23     13
6    Chip   1    23       19    20    15     22
7    Chip   2    24       22    24    17     21
8    Chip   3    12       25    19    21     23
9    Dale   1    15       22    25    22     22
10   Dale   2    18       21    25    24     23
11   Dale   3    17       18    20    25     20

In [4]:
# Get the data corresponding to Unit Test 2
dfUT2 = df[df.UT == 2]
# Sort according to ascending order of marks in Science

In [5]:
print(dfUT2.sort_values(by=['Science']))

     Name  UT  Math  Science  Engl  Hist  Liter
4   Belle   2    23       15    21    25     15
1   Alvin   2    21       20    17    22     24
10   Dale   2    18       21    25    24     23
7    Chip   2    24       22    24    17     21

In [6]:
# Get the data corresponding to Unit Test 3
dfUT3 = df[df.UT == 3]
# Sort according to descending order of marks in Science
print(dfUT3.sort_values(by=['Engl'],ascending=False))

     Name  UT  Math  Science  Engl  Hist  Liter
11   Dale   3    17       18    20    25     20
5   Belle   3    22       18    19    23     13
8    Chip   3    12       25    19    21     23
2   Alvin   3    14       19    15    24     23

In [7]:
# Get the data corresponding to marks in Unit Test 3
dfUT3 = df[df.UT == 3]
# Sort the data according to Science and then according to History
print(dfUT3.sort_values(by=['Science','Hist']))

     Name  UT  Math  Science  Engl  Hist  Liter
5   Belle   3    22       18    19    23     13
11   Dale   3    17       18    20    25     20
2   Alvin   3    14       19    15    24     23
8    Chip   3    12       25    19    21     23

# 2. GROUP BY function

In [8]:
#Create a GROUP BY Name of the student from DataFrame df
g1=df.groupby('Name')

In [9]:
#Displaying the first entry from each group
g1.first()

       UT  Math  Science  Engl  Hist  Liter
Name
Alvin   1    22       21    18    20     21
Belle   1    20       17    22    24     19
Chip    1    23       19    20    15     22
Dale    1    15       22    25    22     22

In [10]:
#Displaying the size of each group
g1.size()

Name
Alvin    3
Belle    3
Chip     3
Dale     3
dtype: int64

In [11]:
#Displaying group data, i.e., group_name, row indexes corresponding to the group and their
#data type
g1.groups

{'Alvin': [0, 1, 2], 'Belle': [3, 4, 5], 'Chip': [6, 7, 8], 'Dale': [9, 10, 11]}

In [12]:
#Printing data of a single group
g1.get_group('Chip')

   Name  UT  Math  Science  Engl  Hist  Liter
6  Chip   1    23       19    20    15     22
7  Chip   2    24       22    24    17     21
8  Chip   3    12       25    19    21     23

In [13]:
#Grouping with respect to multiple attributes
#Creating a GROUP BY Name and UT
g2=df.groupby(['Name','UT'])
g2.first()

          Math  Science  Engl  Hist  Liter
Name  UT
Alvin 1     22       21    18    20     21
      2     21       20    17    22     24
      3     14       19    15    24     23
Belle 1     20       17    22    24     19
      2     23       15    21    25     15
      3     22       18    19    23     13
Chip  1     23       19    20    15     22
      2     24       22    24    17     21
      3     12       25    19    21     23
Dale  1     15       22    25    22     22
      2     18       21    25    24     23
      3     17       18    20    25     20

In [14]:
#Calculating average marks scored by all
#students in each subject for each UT
df.groupby(['UT']).aggregate('mean')

     Math  Science   Engl   Hist  Liter
UT
1   20.00    19.75  21.25  20.25  21.00
2   21.50    19.50  21.75  22.00  20.75
3   16.25    20.00  18.25  23.25  19.75

In [15]:
#Calculate average marks scored in Maths in each UT
group1=df.groupby(['UT'])
group1['Math'].aggregate('mean')

UT
1    20.00
2    21.50
3    16.25
Name: Math, dtype: float64

In [16]:
df.groupby(by='Name')['Math'].agg(['mean','var','std','quantile'])

            mean        var       std  quantile
Name
Alvin  19.000000  19.000000  4.358899      21.0
Belle  21.666667   2.333333  1.527525      22.0
Chip   19.666667  44.333333  6.658328      23.0
Dale   16.666667   2.333333  1.527525      17.0

# 3. Altering the Index

In [17]:
df

     Name  UT  Math  Science  Engl  Hist  Liter
0   Alvin   1    22       21    18    20     21
1   Alvin   2    21       20    17    22     24
2   Alvin   3    14       19    15    24     23
3   Belle   1    20       17    22    24     19
4   Belle   2    23       15    21    25     15
5   Belle   3    22       18    19    23     13
6    Chip   1    23       19    20    15     22
7    Chip   2    24       22    24    17     21
8    Chip   3    12       25    19    21     23
9    Dale   1    15       22    25    22     22
10   Dale   2    18       21    25    24     23
11   Dale   3    17       18    20    25     20

In [18]:
dfUT1 = df[df.UT == 1]
print(dfUT1)

    Name  UT  Math  Science  Engl  Hist  Liter
0  Alvin   1    22       21    18    20     21
3  Belle   1    20       17    22    24     19
6   Chip   1    23       19    20    15     22
9   Dale   1    15       22    25    22     22

In [19]:
dfUT1.reset_index(inplace=True)
print(dfUT1)

   index   Name  UT  Math  Science  Engl  Hist  Liter
0      0  Alvin   1    22       21    18    20     21
1      3  Belle   1    20       17    22    24     19
2      6   Chip   1    23       19    20    15     22
3      9   Dale   1    15       22    25    22     22

In [20]:
dfUT1.drop(columns=['index'],inplace=True)
print(dfUT1)

    Name  UT  Math  Science  Engl  Hist  Liter
0  Alvin   1    22       21    18    20     21
1  Belle   1    20       17    22    24     19
2   Chip   1    23       19    20    15     22
3   Dale   1    15       22    25    22     22

/var/folders/k3/93bf5ryn5057n3c5qrfhj_540000gn/T/ipykernel_12147/3734231493.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dfUT1.drop(columns=['index'],inplace=True)

In [21]:
dfUT1.set_index('Hist',inplace=True)
print(dfUT1)

       Name  UT  Math  Science  Engl  Liter
Hist
20    Alvin   1    22       21    18     21
24    Belle   1    20       17    22     19
15     Chip   1    23       19    20     22
22     Dale   1    15       22    25     22

In [22]:
dfUT1.reset_index('Hist', inplace = True)
print(dfUT1)

   Hist   Name  UT  Math  Science  Engl  Liter
0    20  Alvin   1    22       21    18     21
1    24  Belle   1    20       17    22     19
2    15   Chip   1    23       19    20     22
3    22   Dale   1    15       22    25     22

# 5. Other dataFrame operatIons

## 5.1. Reshaping Data

### _(A) Pivot_

In [23]:
data={'Store':['S1','S4','S3','S1','S2','S3','S1','S2','S3'], 'Year':[2016,2016,2016,2017,2017,2017,2018,2018,2018],
'Total_sales(Rs)':[12000,330000,420000,20000,10000,450000,30000, 11000,89000],
'Total_profit(Rs)':[1100,5500,21000,32000,9000,45000,3000,1900,23000]
}

In [24]:
df=pd.DataFrame(data)
print(df)

  Store  Year  Total_sales(Rs)  Total_profit(Rs)
0    S1  2016            12000              1100
1    S4  2016           330000              5500
2    S3  2016           420000             21000
3    S1  2017            20000             32000
4    S2  2017            10000              9000
5    S3  2017           450000             45000
6    S1  2018            30000              3000
7    S2  2018            11000              1900
8    S3  2018            89000             23000

In [25]:
# 1) 
#will get the data related to store S1
S1df = df[df.Store=='S1']
#find the total of sales for Store S1
S1df['Total_sales(Rs)'].sum()

62000

In [26]:
# 2)
#will get the data related to store S3
S3df = df[df.Store=='S3']
#find the maximum sale for Store S3
S3df['Total_sales(Rs)'].max()

450000

In [27]:
# 3) 
S1df = df[df.Store=='S1']
S2df=df[df.Store == 'S2']
S3df = df[df.Store=='S3']
S4df = df[df.Store=='S4']
S1total = S1df['Total_sales(Rs)'].sum()
S2total = S2df['Total_sales(Rs)'].sum()
S3total = S3df['Total_sales(Rs)'].sum()
S4total = S4df['Total_sales(Rs)'].sum()
max(S1total,S2total,S3total,S4total)

959000

In [28]:
pivot1=df.pivot(index='Store',columns='Year',values='Total_sales(Rs)')

In [29]:
print(pivot1)

Year       2016      2017     2018
Store
S1      12000.0   20000.0  30000.0
S2          NaN   10000.0  11000.0
S3     420000.0  450000.0  89000.0
S4     330000.0       NaN      NaN

In [30]:
#1.1. 
pivot1.loc['S1'].sum()

62000.0

In [31]:
#1.2.
pivot1.loc['S3'].max()

450000.0

In [32]:
#1.3.
S1total = pivot1.loc['S1'].sum()
S2total = pivot1.loc['S2'].sum()
S3total = pivot1.loc['S3'].sum()
S4total = pivot1.loc['S4'].sum()
max(S1total,S2total,S3total,S4total)

959000.0

### _B) Pivoting by Multiple Columns_

In [33]:
pivot2=df.pivot(index='Store',columns='Year',values=['Total_sales(Rs)','Total_profit(Rs)'])
print(pivot2)

      Total_sales(Rs)                    Total_profit(Rs)
Year             2016      2017     2018             2016     2017     2018
Store
S1            12000.0   20000.0  30000.0           1100.0  32000.0   3000.0
S2                NaN   10000.0  11000.0              NaN   9000.0   1900.0
S3           420000.0  450000.0  89000.0          21000.0  45000.0  23000.0
S4           330000.0       NaN      NaN           5500.0      NaN      NaN

In [41]:
df=pd.DataFrame({'Item':['Pen','Pen2','Pencil','Pencil2','Marker','Marker2'],
'Color':['Red','Red','Black','Black','Blue','Blue'],
'Price(Rs)':[10,25,7,5,50,20],
'Units_in_stock':[50,10,47,34,55,14]
})
print(df)

      Item  Color  Price(Rs)  Units_in_stock
0      Pen    Red         10              50
1     Pen2    Red         25              10
2   Pencil  Black          7              47
3  Pencil2  Black          5              34
4   Marker   Blue         50              55
5  Marker2   Blue         20              14

In [43]:
pivot3=df.pivot(index='Item',columns='Color',values='Price(Rs)')
pivot3

Color    Black  Blue   Red
Item
Marker     NaN  50.0   NaN
Marker2    NaN  20.0   NaN
Pen        NaN   NaN  10.0
Pen2       NaN   NaN  25.0
Pencil     7.0   NaN   NaN
Pencil2    5.0   NaN   NaN

### _C) Pivot Table_

## Syntax:
_pandas.pivot_table(data, values=None,index=None,columns=None, aggfunc='mean')_

In [44]:
df1 = df.pivot_table(index=['Item','Color']) # default  aggfunc = 'mean'

In [45]:
print(df1)

               Price(Rs)  Units_in_stock
Item    Color
Marker  Blue          50              55
Marker2 Blue          20              14
Pen     Red           10              50
Pen2    Red           25              10
Pencil  Black          7              47
Pencil2 Black          5              34

In [46]:
import numpy as np
pivot_table1=df.pivot_table(index='Item',columns='Color',values='Units_in_stock',aggfunc=[sum,max,np.mean])
pivot_table1

          sum               max              mean
Color   Black  Blue   Red Black  Blue   Red Black  Blue   Red
Item
Marker    NaN  55.0   NaN   NaN  55.0   NaN   NaN  55.0   NaN
Marker2   NaN  14.0   NaN   NaN  14.0   NaN   NaN  14.0   NaN
Pen       NaN   NaN  50.0   NaN   NaN  50.0   NaN   NaN  50.0
Pen2      NaN   NaN  10.0   NaN   NaN  10.0   NaN   NaN  10.0
Pencil   47.0   NaN   NaN  47.0   NaN   NaN  47.0   NaN   NaN
Pencil2  34.0   NaN   NaN  34.0   NaN   NaN  34.0   NaN   NaN

In [47]:
pivot_table1=df.pivot_table(index='Item',columns='Color',values=['Price(Rs)','Units_in_stock'],aggfunc={"Price(Rs)":len,"Units_in_stock":np.mean})
pivot_table1

        Price(Rs)           Units_in_stock
Color       Black Blue  Red          Black  Blue   Red
Item
Marker        NaN  1.0  NaN            NaN  55.0   NaN
Marker2       NaN  1.0  NaN            NaN  14.0   NaN
Pen           NaN  NaN  1.0            NaN   NaN  50.0
Pen2          NaN  NaN  1.0            NaN   NaN  10.0
Pencil        1.0  NaN  NaN           47.0   NaN   NaN
Pencil2       1.0  NaN  NaN           34.0   NaN   NaN

In [48]:
dfpen=df[df.Item=='Pen']
pivot_redpen=dfpen.pivot_table(index='Item',columns=['Color'],values=['Price(Rs)'],aggfunc=[max])

In [49]:
print(pivot_redpen)

            max
      Price(Rs)
Color       Red
Item
Pen          10

# 6. HandlIng Missing Values

In [50]:
import numpy as np
marksUT = {
'Name':['Alvin','Alvin','Alvin','Alvin','Belle','Belle','Belle','Belle','Chip','Chip','Chip','Chip','Dale','Dale','Dale','Dale'],
'UT':[1,2,3,4,1,2,3,4,1,2,3,4,1,2,3,4],
'Math':[22,21,14,np.NaN,20,23,22,19,23,24,12,15,15,18,17,14],
'Science':[21,20,19,np.NaN,np.NaN,15,18,20,19,22,25,20,22,21,18,20],
'Engl':[18,17,15,19,22,21,19,17,20,24,19,20,25,25,20,19],
'Hist':[20,22,24,18,24,25,23,21, 15,17,21,20,22,24,25,20],
'Liter':[21,24,23,np.NaN,19,15,13,16,22,21,23,17,22,23,20,18] }
df = pd.DataFrame(marksUT)
print(df.isnull())

     Name     UT   Math  Science   Engl   Hist  Liter
0   False  False  False    False  False  False  False
1   False  False  False    False  False  False  False
2   False  False  False    False  False  False  False
3   False  False   True     True  False  False   True
4   False  False  False     True  False  False  False
5   False  False  False    False  False  False  False
6   False  False  False    False  False  False  False
7   False  False  False    False  False  False  False
8   False  False  False    False  False  False  False
9   False  False  False    False  False  False  False
10  False  False  False    False  False  False  False
11  False  False  False    False  False  False  False
12  False  False  False    False  False  False  False
13  False  False  False    False  False  False  False
14  False  False  False    False  False  False  False
15  False  False  False    False  False  False  False

In [51]:
print(df['Science'].isnull())

0     False
1     False
2     False
3      True
4      True
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
15    False
Name: Science, dtype: bool

In [52]:
print(df.isnull().any())

Name       False
UT         False
Math        True
Science     True
Engl       False
Hist       False
Liter       True
dtype: bool

In [53]:
print(df['Science'].isnull().any())

True

In [54]:
print(df['Hist'].isnull().any())

False

In [55]:
print(df.isnull().sum())

Name       0
UT         0
Math       1
Science    2
Engl       0
Hist       0
Liter      1
dtype: int64

In [56]:
print(df.isnull().sum().sum())

4

In [57]:
dfAlvin = df[df['Name']=='Alvin']
print('Marks Scored by Alvin \n\n',dfAlvin)

Marks Scored by Alvin

     Name  UT  Math  Science  Engl  Hist  Liter
0  Alvin   1  22.0     21.0    18    20   21.0
1  Alvin   2  21.0     20.0    17    22   24.0
2  Alvin   3  14.0     19.0    15    24   23.0
3  Alvin   4   NaN      NaN    19    18    NaN

In [58]:
dfHist = dfAlvin['Hist']
print("Marks Scored by Alvin in History\n\n",dfHist)

Marks Scored by Alvin in History

 0    20
1    22
2    24
3    18
Name: Hist, dtype: int64

In [59]:
row = len(dfHist) # Number of Unit Tests held. Here row will be 4

In [60]:
print("Percentage of Marks Scored by Alvin in History\n\n",(dfHist.sum()*100)/(25*row),"%")

Percentage of Marks Scored by Alvin in History

 84.0 %

In [61]:
dfMath = dfAlvin['Math']
print("Marks Scored by Alvin in Math\n\n",dfMath)

Marks Scored by Alvin in Math

 0    22.0
1    21.0
2    14.0
3     NaN
Name: Math, dtype: float64

In [62]:
row = len(dfMath) # here, row will be 4, the number of Unit Tests
print("Percentage of Marks Scored by Alvin in Maths\n\n", dfMath.sum()*100/(25*row),"%")

Percentage of Marks Scored by Alvin in Maths

 57.0 %

## 6.2.  Dropping Missing Values

In [63]:
df1 = df.dropna()
print(df1)

     Name  UT  Math  Science  Engl  Hist  Liter
0   Alvin   1  22.0     21.0    18    20   21.0
1   Alvin   2  21.0     20.0    17    22   24.0
2   Alvin   3  14.0     19.0    15    24   23.0
5   Belle   2  23.0     15.0    21    25   15.0
6   Belle   3  22.0     18.0    19    23   13.0
7   Belle   4  19.0     20.0    17    21   16.0
8    Chip   1  23.0     19.0    20    15   22.0
9    Chip   2  24.0     22.0    24    17   21.0
10   Chip   3  12.0     25.0    19    21   23.0
11   Chip   4  15.0     20.0    20    20   17.0
12   Dale   1  15.0     22.0    25    22   22.0
13   Dale   2  18.0     21.0    25    24   23.0
14   Dale   3  17.0     18.0    20    25   20.0
15   Dale   4  14.0     20.0    19    20   18.0

In [64]:
# marks obtained by Alvin in all the unit tests
dfAlvin=df[df.Name=='Alvin']

In [65]:
# inplace=true makes changes in the 
#original DataFrame i.e. dfAlvin 
dfAlvin.dropna(inplace=True,how='any')
dfMath = dfAlvin['Math'] # get the marks scored in Maths
print("\nMarks Scored by Alvin in Maths\n",dfMath)

Marks Scored by Alvin in Maths
 0    22.0
1    21.0
2    14.0
Name: Math, dtype: float64

/var/folders/k3/93bf5ryn5057n3c5qrfhj_540000gn/T/ipykernel_12147/3817012395.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dfAlvin.dropna(inplace=True,how='any')

In [66]:
row = len(dfMath) # row = 3
print("\nPercentage of Marks Scored by Alvin in Maths\n")
print(dfMath.sum()*100/(25*row),"%")

Percentage of Marks Scored by Alvin in Maths

76.0 %

## 6.3. Estimating Missing Values

In [67]:
#Marks Scored by Alvin in all the subjects across the tests
dfAlvin = df.loc[df['Name']=='Alvin']

In [68]:
(row,col) = dfAlvin.shape
dfScience = dfAlvin.loc[:,'Science']
print("Marks Scored by Alvin in Science\n\n",dfScience)

Marks Scored by Alvin in Science

 0    21.0
1    20.0
2    19.0
3     NaN
Name: Science, dtype: float64

In [69]:
dfFillZeroScience = dfScience.fillna(0)
print('\nMarks Scored by Alvin in Science with Missing Values Replaced with Zero\n',dfFillZeroScience)

Marks Scored by Alvin in Science with Missing Values Replaced with Zero
 0    21.0
1    20.0
2    19.0
3     0.0
Name: Science, dtype: float64

In [70]:
print("Percentage of Marks Scored by Alvin in Science\n\n",dfFillZeroScience.sum()*100/(25*row),"%")

Percentage of Marks Scored by Alvin in Science

 60.0 %

In [71]:
dfEng = dfAlvin.loc[:,'Liter']
print("Marks Scored by Alvin in English\n\n",dfEng)

Marks Scored by Alvin in English

 0    21.0
1    24.0
2    23.0
3     NaN
Name: Liter, dtype: float64

In [72]:
dfFillPadEng = dfEng.fillna(method='pad')
print('\nMarks Scored by Alvin in English with Missing Values Replaced by Previous Test Marks\n',dfFillPadEng)

Marks Scored by Alvin in English with Missing Values Replaced by Previous Test Marks
 0    21.0
1    24.0
2    23.0
3    23.0
Name: Liter, dtype: float64

In [73]:
print("Percentage of Marks Scored by Alvin in English\n\n")
print(dfFillPadEng.sum()*100/(25*row),"%")

Percentage of Marks Scored by Alvin in English


91.0 %

# Exercises:

http://archive.ics.uci.edu/ml/machine-learning-databases/auto-mpg/

Following are the exercises to analyse the data.

1) Load auto-mpg.data into a DataFrame autodf.

2) Give description of the generated DataFrame autodf. (Description-> Main Statistics) .describe() OR aggregate()

3) Display the first 10 rows of the DataFrame autodf.  head(10)

4) Find the attributes which have missing values.
Handle the missing values using following two
ways:
   
   i. Replace the missing values by a value before
that. method = 'pad'

   ii. Remove the rows having missing values from
the original dataset
            dropna()

5) Print the details of the car which gave the
maximum mileage.

6) Find the average displacement of the car given
the number of cylinders. mean

7) What is the average number of cylinders in a car? [cylinder] -> mean

8) Determine the no. of cars with weight greater
than the average weight. count